# **Basics of Pandas**

Pandas in the Python package providing fast flexible and expressive Data Structure designed to make working with "relational" or "level" data with easy and intuitive

Here are just few of the things that pandas does well: it function for analysing ,cleaning ,explorng and manipulating data

#### **1)Creating a Series: Series()**

In [3]:
import pandas as pd

data = [10, 20, 30, 40]
series = pd.Series(data)
print(series)

0    10
1    20
2    30
3    40
dtype: int64

#### **2)Creating a Dataframe:DataFrame()**

In [3]:
import pandas as pd
data={'Name':['Siya','Saniya','Devansh'],
      'Age':[21,19,12],
      'Height':[155,162,133]}

df=pd.DataFrame(data)
print(df)

      Name  Age  Height
0     Siya   21     155
1   Saniya   19     162
2  Devansh   12     133

#### **3)Reading from CSV File:read_csv(file name)**

In [1]:
import pandas as pd
data =pd.read_csv('file.csv')
print(data) #print whole file data

    Annual income
0         62000.0
1         64000.0
2         49000.0
3        324000.0
4       1264000.0
5         54330.0
6         64000.0
7         51000.0
8         55000.0
9         48000.0
10        53000.0

#### **4)Using head() and tail() function**

In [2]:
import pandas as pd
data =pd.read_csv(('file.csv'))
print(data.head())  # Show first 5 rows
print(data.tail())  # Show last 5 rows

   Annual income
0        62000.0
1        64000.0
2        49000.0
3       324000.0
4      1264000.0
    Annual income
6         64000.0
7         51000.0
8         55000.0
9         48000.0
10        53000.0

#### 5)**Reading CSV file from another folder:read_csv(path)**

In [11]:
import pandas as pd
data=pd.read_csv(("C:/Users/Siya Yadav/OneDrive/Desktop/practice.csv"))
print(data)

       Jaswinder kaur Khullar  Nokia India
0     Gaurav Singh Chauhan    Google India
1  Rashmita Bhowmick       Microsoft India
2              Munwar Khan             AWS
3            Nishant                 Zupee

#### 6)**Reading Excel file:read_excel()**

In [61]:
import pandas as pd
data=pd.read_excel("C:/Users/Siya Yadav/OneDrive/Desktop/rajesh kumar/ARB FM MASTER SHEET_2019-2021.xlsx")
print(data)
#install the extension openpyxl

        SL       Reg No              EMP NAME           FATHER NAME  \
0      1.0  ARB/001/GUR          RAJESH KUMAR          SURJIT SINGH
1      2.0  ARB/002/GUR         YOGESH SHARMA         RAJPAL SHARMA
2      3.0  ARB/003/GUR  WAKIL BAHADUR KHADKA  GOKUL BAHADUR KHADKA
3      4.0  ARB/004/GUR         PARVEEN KUMAR    BAL KRISHAN SHARMA
4      5.0  ARB/005/GUR      AFAJADDIN SARKAR     GOFARADDIN SARKAR
..     ...          ...                   ...                   ...
226  226.0          NaN                   NaN                   NaN
227  227.0          NaN                   NaN                   NaN
228  228.0          NaN                   NaN                   NaN
229  229.0          NaN                                         NaN
230  230.0          NaN                   NaN                   NaN

            DESI                D O B                D O J  LWD  \
0       OPS HEAD  1978-09-21 00:00:00  2019-06-01 00:00:00  NaN
1    OPS MANAGER  1985-06-07 00:00:00  2019-06-01 00:00:00  NaN
2        S/GUARD  1977-02-03 00:00:00  2019-06-10 00:00:00  NaN
3        S/GUARD  1980-09-22 00:00:00  2019-06-10 00:00:00  NaN
4        S/GUARD  1960-02-15 00:00:00  2019-06-23 00:00:00  NaN
..           ...                  ...                  ...  ...
226          NaN                  NaN                  NaN  NaN
227          NaN                  NaN                  NaN  NaN
228          NaN                  NaN                  NaN  NaN
229          NaN                  NaN                  NaN  NaN
230          NaN                  NaN                  NaN  NaN

                                   PMT ADDRESS PRESANT ADDRASS   ...   Salary  \
0                VILL-SILOKHRA, GUR, HR-122001              NaN  ...      NaN
1                VILL TATARPUR, GGN, HR-122413              NaN  ...  30000.0
2           DLF Ph-3, Nathupur, GGN, HR-122001              NaN  ...  11200.0
3     Hno-236/1, Adharsh Nagar, GGN, HR-122001              NaN  ...  11200.0
4    Buniadpur Kail,Dakshin Dinajpur,WB-733121              NaN  ...  11200.0
..                                         ...              ...  ...      ...
226                                        NaN              NaN  ...      NaN
227                                        NaN              NaN  ...      NaN
228                                        NaN              NaN  ...      NaN
229                                        NaN              NaN  ...      NaN
230                                        NaN              NaN  ...      NaN

       Remark   Bank Account No    IFSC Code            Bank  ESI  \
0      Active               NaN          NaN             NaN  NaN
1      Active       50391194575          NaN  ALLAHABAD BANK  NaN
2    RESIGNED               NaN          NaN             NaN  NaN
3    RESIGNED  2802500100166301  KARB0000280  KARNATAKA BANK  NaN
4    RESIGNED    50100269404721  HDFC0003666            HDFC  NaN
..        ...               ...          ...             ...  ...
226       NaN               NaN          NaN             NaN  NaN
227       NaN               NaN          NaN             NaN  NaN
228       NaN               NaN          NaN             NaN  NaN
229       NaN               NaN          NaN             NaN  NaN
230       NaN               NaN          NaN             NaN  NaN

                      PF NO        UAN NO REJOINED EXPERIENCE
0                       NaN           NaN      NaN        NaN
1                       NaN           NaN      NaN        NaN
2                       NaN           NaN      NaN        NaN
3                       NaN           NaN      NaN        NaN
4    HRFBD17472150000010075  101482844906      NaN        NaN
..                      ...           ...      ...        ...
226                     NaN           NaN      NaN        NaN
227                     NaN           NaN      NaN        NaN
228                     NaN           NaN      NaN        NaN
229                     NaN           NaN      NaN        NaN
230                     NaN           NaN      NaN        NaN

[231 rows x 26 columns]

#### **7)Writing to a CSV File:to_csv()**

In [9]:
import pandas as pd
data={'Name':['Siya','Saniya','Devansh'],
      'Age':[21,19,12],
      'Height':[155,162,133]}
df=pd.DataFrame(data)
df.to_csv('practice.csv', index=False)

#### **8)Information of data: info()**

In [14]:
print(df.info()) # Summary of dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    3 non-null      object
 1   Age     3 non-null      int64
 2   Height  3 non-null      int64
dtypes: int64(2), object(1)
memory usage: 204.0+ bytes
None

#### **9)Describing data:describe()**

In [13]:
print(df.describe()) # Statistical summary

             Age      Height
count   3.000000    3.000000
mean   17.333333  150.000000
std     4.725816   15.132746
min    12.000000  133.000000
25%    15.500000  144.000000
50%    19.000000  155.000000
75%    20.000000  158.500000
max    21.000000  162.000000

#### **10)Checking Shape and Columns:shape() and columns()**

In [12]:
print(df.shape)  # (rows, columns)
print(df.columns)  # List of column names

(3, 3)
Index(['Name', 'Age', 'Height'], dtype='object')

#### **11)checking the null values:isnull()**

In [17]:
print(df.isnull())
print(df.isnull().sum()) # organize columnvise null values count

    Name    Age  Height
0  False  False   False
1  False  False   False
2  False  False   False
Name      0
Age       0
Height    0
dtype: int64

#### **12)Check duplicate value in file:duplicated()**

In [18]:
print(df.duplicated())

0    False
1    False
2    False
dtype: bool

#### **13)dropping duplicate values:drop_duplicates()**

In [23]:
import pandas as pd
data=pd.read_csv('values.csv')
print(data)
print(data.duplicated())
print(data.drop_duplicates("SMQ020"))

       SEQN  ALQ101  ALQ110  ALQ130  SMQ020  RIAGENDR  RIDAGEYR  RIDRETH1  \
0     83732     1.0     NaN     1.0       1         1        62         3
1     83733     1.0     NaN     6.0       1         1        53         3
2     83734     1.0     NaN     NaN       1         1        78         3
3     83735     2.0     1.0     1.0       2         2        56         3
4     83736     2.0     1.0     1.0       2         2        42         4
...     ...     ...     ...     ...     ...       ...       ...       ...
5730  93695     2.0     2.0     NaN       1         2        76         3
5731  93696     2.0     2.0     NaN       2         1        26         3
5732  93697     1.0     NaN     1.0       1         2        80         3
5733  93700     NaN     NaN     NaN       1         1        35         3
5734  93702     1.0     NaN     2.0       2         2        24         3

      DMDCITZN  DMDEDUC2  ...  BPXSY2  BPXDI2  BMXWT  BMXHT  BMXBMI  BMXLEG  \
0          1.0       5.0  ...   124.0    64.0   94.8  184.5    27.8    43.3
1          2.0       3.0  ...   140.0    88.0   90.4  171.4    30.8    38.0
2          1.0       3.0  ...   132.0    44.0   83.4  170.1    28.8    35.6
3          1.0       5.0  ...   134.0    68.0  109.8  160.9    42.4    38.5
4          1.0       4.0  ...   114.0    54.0   55.2  164.9    20.3    37.4
...        ...       ...  ...     ...     ...    ...    ...     ...     ...
5730       1.0       3.0  ...   112.0    46.0   59.1  165.8    21.5    38.2
5731       1.0       5.0  ...   116.0    76.0  112.1  182.2    33.8    43.4
5732       1.0       4.0  ...   146.0    58.0   71.7  152.2    31.0    31.3
5733       2.0       1.0  ...   106.0    66.0   78.2  173.3    26.0    40.3
5734       1.0       5.0  ...   114.0    68.0   58.3  165.0    21.4    38.2

      BMXARML  BMXARMC  BMXWAIST  HIQ210
0        43.6     35.9     101.1     2.0
1        40.0     33.2     107.9     NaN
2        37.0     31.0     116.5     2.0
3        37.7     38.3     110.1     2.0
4        36.0     27.2      80.4     2.0
...       ...      ...       ...     ...
5730     37.0     29.5      95.0     2.0
5731     41.8     42.3     110.2     2.0
5732     37.5     28.8       NaN     2.0
5733     37.5     30.6      98.9     2.0
5734     33.5     26.2      72.5     2.0

[5735 rows x 28 columns]
0       False
1       False
2       False
3       False
4       False
        ...
5730    False
5731    False
5732    False
5733    False
5734    False
Length: 5735, dtype: bool
       SEQN  ALQ101  ALQ110  ALQ130  SMQ020  RIAGENDR  RIDAGEYR  RIDRETH1  \
0     83732     1.0     NaN     1.0       1         1        62         3
3     83735     2.0     1.0     1.0       2         2        56         3
288   84227     NaN     NaN     NaN       7         1        36         3
1331  85998     1.0     NaN     2.0       9         1        80         1

      DMDCITZN  DMDEDUC2  ...  BPXSY2  BPXDI2  BMXWT  BMXHT  BMXBMI  BMXLEG  \
0          1.0       5.0  ...   124.0    64.0   94.8  184.5    27.8    43.3
3          1.0       5.0  ...   134.0    68.0  109.8  160.9    42.4    38.5
288        1.0       1.0  ...   100.0    54.0   61.9  173.7    20.5    41.1
1331       1.0       9.0  ...     NaN     NaN   79.1  164.8    29.1     NaN

      BMXARML  BMXARMC  BMXWAIST  HIQ210
0        43.6     35.9     101.1     2.0
3        37.7     38.3     110.1     2.0
288      36.5     26.6      79.6     NaN
1331      NaN      NaN       NaN     2.0

[4 rows x 28 columns]

#### **14)Selecting Rows:(Using .loc() and .iloc())**

In [28]:
import pandas as pd
data=pd.read_csv("practice.csv")
print(data)
print(df.loc[1])  # Select row by index label
print(df.iloc[2])  # Select row by position

      Name  Age  Height
0     Siya   21     155
1   Saniya   19     162
2  Devansh   12     133
Name      Saniya
Age           19
Height       162
Name: 1, dtype: object
Name      Devansh
Age            12
Height        133
Name: 2, dtype: object

#### **15)Selecting Columns**

In [31]:
print(df['Name'])  # Select one column
print(df[['Name', 'Age']])  # Select multiple columns

0       Siya
1     Saniya
2    Devansh
Name: Name, dtype: object
      Name  Age
0     Siya   21
1   Saniya   19
2  Devansh   12

#### **16) Filtering the data**

In [32]:
print(df[df['Age'] > 15])  # Select rows where Age > 15

     Name  Age  Height
0    Siya   21     155
1  Saniya   19     162

#### **17)Adding new columns**

In [34]:
df['Salary'] = [50000, 60000, 70000]
print(df)

      Name  Age  Height  Salary
0     Siya   21     155   50000
1   Saniya   19     162   60000
2  Devansh   12     133   70000

#### **18)Updating Values**

In [37]:
df.loc[1, 'Age'] = 32  # Update Saniya's age to 32
print(df)

      Name  Age  Height  Salary
0     Siya   21     155   50000
1   Saniya   32     162   60000
2  Devansh   12     133   70000

#### **19)Dropping a Column**

In [43]:
df = df.drop(columns=['Age'])
print(df)

      Name  Height  Salary
0     Siya     155   50000
1   Saniya     162   60000
2  Devansh     133   70000

#### **20)Dropping a Rows**

In [46]:
df = df.drop(index=0)  # Drop row with index 1
print(df)

      Name  Height  Salary
2  Devansh     133   70000

#### **21) Basics statistics & Spread Dispersion**

In [60]:
import pandas as pd
data=pd.read_csv("practice.csv")
print(data)
print(data["Height"].mean())
print(data["Age"].min())
print(data["Age"].max())
print(data["Age"].mode())
print(data["Age"].median())
print(data["Age"].sum())
print(data["Age"].count())
print('-------------------')
print(data["Age"].std())
print(data["Age"].var())
#print(data["Age"].mad())
#print(data["Age"].quar(0.25))

      Name  Age  Height
0     Siya   21     155
1   Saniya   19     162
2  Devansh   12     133
150.0
12
21
0    12
1    19
2    21
Name: Age, dtype: int64
19.0
52
3
-------------------
4.725815626252609
22.333333333333336

### **FURTHERMORE WE WILL LEARN MORE IN THE UPCOMING SESSIONS!! :)**